Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
     *** LPUART HAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in LPUART HAL driver.

      (+) __HAL_LPUART_GET_FLAG : Check whether the specified LPUART flag is set or not
      (+) __HAL_LPUART_CLEAR_FLAG : Clear the specified LPUART pending flag
      (+) __HAL_LPUART_ENABLE_IT: Enable the specified LPUART interrupt
      (+) __HAL_LPUART_DISABLE_IT: Disable the specified LPUART interrupt
      (+) __HAL_LPUART_GET_IT_SOURCE: Check whether the specified LPUART interrupt has occurred or not

     [..]
       (@) You can refer to the LPUART HAL driver header file for more useful macros

  @endverbatim
     [..]
       (@) Additionnal remark: If the parity is enabled, then the MSB bit of the data written
           in the data register is transmitted but is changed by the parity bit.
           Depending on the frame length defined by the M_E bit (8-bits or 9-bits),
           the possible LPUART frame formats are as listed in the following table:
    +-------------------------------------------------------------+
    | M_E bit |  PCE bit  |            LPUART frame               |
    |---------------------|---------------------------------------|
    |    0    |    0      |    | SB | 8 bit data | STB |          |
    |---------|-----------|---------------------------------------|
    |    0    |    1      |    | SB | 8 bit data | PB | STB |     |
    |---------|-----------|---------------------------------------|
    |    1    |    0      |    | SB | 9 bit data | STB |          |
    |---------|-----------|---------------------------------------|
    |    1    |    1      |    | SB | 9 bit data | PB | STB |     |
    +-------------------------------------------------------------+
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"
#include "py32e407_hal_lpuart.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @defgroup LPUART LPUART
  * @brief HAL LPUART module driver
  * @{
  */

#ifdef HAL_LPUART_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup LPUART_Private_Constants LPUART Private Constants
  * @{
  */
#define LPUART_CR1_FIELDS  ((uint32_t)(LPUART_CR1_M0 | LPUART_CR1_M1  | LPUART_CR1_PCE | LPUART_CR1_PS | \
                                       LPUART_CR1_TE | LPUART_CR1_RE  | LPUART_CR1_FIFOEN )) /*!< LPUART CR1 fields of parameters set by LPUART_SetConfig API */

#define LPUART_CR3_FIELDS  ((uint32_t)(LPUART_CR3_RTSE | LPUART_CR3_CTSE | LPUART_CR3_TXFTCFG | LPUART_CR3_RXFTCFG )) /*!< LPUART CR3 fields of parameters set by LPUART_SetConfig API */

#define LPUART_BRR_MIN  0x00000300U  /* LPUART BRR minimum authorized value */
#define LPUART_BRR_MAX  0x000FFFFFU  /* LPUART BRR maximum authorized value */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
const uint16_t LPUARTPrescTable[12] = {1U, 2U, 4U, 6U, 8U, 10U, 12U, 16U, 32U, 64U, 128U, 256U};

/* Private function prototypes -----------------------------------------------*/
/** @addtogroup LPUART_Private_Functions
  * @{
  */
static void LPUART_EndTxTransfer(LPUART_HandleTypeDef *hlpuart);
static void LPUART_EndRxTransfer(LPUART_HandleTypeDef *hlpuart);

static void LPUART_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMARxBlockCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMARxHalfBlockCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMASrcTranCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMATxBlockCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMATxHalfBlockCplt(DMA_HandleTypeDef *hdma);
static void LPUART_DMADstTranCplt(DMA_HandleTypeDef *hdma);

static void LPUART_DMAError(DMA_HandleTypeDef *hdma);
static void LPUART_DMAAbortOnError(DMA_HandleTypeDef *hdma);
static void LPUART_DMATxAbortCallback(DMA_HandleTypeDef *hdma);
static void LPUART_DMARxAbortCallback(DMA_HandleTypeDef *hdma);
static void LPUART_DMATxOnlyAbortCallback(DMA_HandleTypeDef *hdma);
static void LPUART_DMARxOnlyAbortCallback(DMA_HandleTypeDef *hdma);

static void LPUART_TxISR_8BIT(LPUART_HandleTypeDef *hlpuart);
static void LPUART_TxISR_16BIT(LPUART_HandleTypeDef *hlpuart);
static void LPUART_TxISR_8BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart);
static void LPUART_TxISR_16BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart);
static void LPUART_EndTransmit_IT(LPUART_HandleTypeDef *hlpuart);
static void LPUART_RxISR_8BIT(LPUART_HandleTypeDef *hlpuart);
static void LPUART_RxISR_16BIT(LPUART_HandleTypeDef *hlpuart);
static void LPUART_RxISR_8BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart);
static void LPUART_RxISR_16BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup LPUART_Exported_Functions LPUART Exported Functions
  * @{
  */

/** @defgroup LPUART_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to initialize the LPUARTx or the LPUARTy
    in asynchronous mode.
      (+) For the asynchronous mode the parameters below can be configured:
        (++) Baud Rate
        (++) Word Length
        (++) Stop Bit
        (++) Parity: If the parity is enabled, then the MSB bit of the data written
             in the data register is transmitted but is changed by the parity bit.
        (++) Hardware flow control
        (++) Receiver/transmitter modes
        (++) Over Sampling Method
        (++) One-Bit Sampling Method
      (+) For the asynchronous mode, the following advanced features can be configured as well:
        (++) TX and/or RX pin level inversion
        (++) data logical level inversion
        (++) RX and TX pins swap
        (++) RX overrun detection disabling
        (++) DMA disabling on RX error
        (++) MSB first on communication line
        (++) auto Baud rate detection
    [..]
    The HAL_LPUART_Init(), HAL_HalfDuplex_Init() and HAL_MultiProcessor_Init()API
    follow respectively the LPUART asynchronous, LPUART Half duplex, LPUART LIN mode
    and LPUART multiprocessor mode configuration procedures (details for the procedures
    are available in reference manual).

@endverbatim

