Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* Check that a Tx process is not already ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->gState = HAL_LPUART_STATE_BUSY_TX;

    /* Init tickstart for timeout management */
    tickstart = HAL_GetTick();

    hlpuart->TxXferSize  = Size;
    hlpuart->TxXferCount = Size;

    /* In case of 9bits/No Parity transfer, pData needs to be handled as a uint16_t pointer */
    if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
    {
      pdata8bits  = NULL;
      pdata16bits = (uint16_t *) pData;
    }
    else
    {
      pdata8bits  = pData;
      pdata16bits = NULL;
    }

    __HAL_UNLOCK(hlpuart);

    while (hlpuart->TxXferCount > 0U)
    {
      if (LPUART_WaitOnFlagUntilTimeout(hlpuart, LPUART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }
      if (pdata8bits == NULL)
      {
        hlpuart->Instance->TDR = (uint16_t)(*pdata16bits & 0x01FFU);
        pdata16bits++;
      }
      else
      {
        hlpuart->Instance->TDR = (uint8_t)(*pdata8bits & 0xFFU);
        pdata8bits++;
      }
      hlpuart->TxXferCount--;
    }

    if (LPUART_WaitOnFlagUntilTimeout(hlpuart, LPUART_FLAG_TC, RESET, tickstart, Timeout) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* At end of Tx process, restore hlpuart->gState to Ready */
    hlpuart->gState = HAL_LPUART_STATE_READY;

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Receive an amount of data in blocking mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @note When FIFO mode is enabled, the RXNE flag is set as long as the RXFIFO
  *       is not empty. Read operations from the RDR register are performed when
  *       RXNE flag is set. From hardware perspective, RXNE flag and is mapped on the same bit-field.
  * @param hlpuart   LPUART handle.
  * @param pData   Pointer to data buffer (u8 or u16 data elements).
  * @param Size    Amount of data elements (u8 or u16 or u32) to be received.
  * @param Timeout Timeout duration.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Receive(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size, uint32_t Timeout)
{
  uint8_t  *pdata8bits;
  uint16_t *pdata16bits;
  uint16_t uhMask;
  uint32_t tickstart;

  /* Check that a Rx process is not already ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return  HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->RxState = HAL_LPUART_STATE_BUSY_RX;

    /* Init tickstart for timeout management */
    tickstart = HAL_GetTick();

    hlpuart->RxXferSize  = Size;
    hlpuart->RxXferCount = Size;

    /* Computation of LPUART mask to apply to RDR register */
    LPUART_MASK_COMPUTATION(hlpuart);
    uhMask = hlpuart->Mask;

    /* In case of 9bits/No Parity transfer, pRxData needs to be handled as a uint16_t pointer */
    if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
    {
      pdata8bits  = NULL;
      pdata16bits = (uint16_t *) pData;
    }
    else
    {
      pdata8bits  = pData;
      pdata16bits = NULL;
    }

    __HAL_UNLOCK(hlpuart);

    /* as long as data have to be received */
    while (hlpuart->RxXferCount > 0U)
    {
      if (LPUART_WaitOnFlagUntilTimeout(hlpuart, LPUART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
      {
        return HAL_TIMEOUT;
      }
      if (pdata8bits == NULL)
      {
        *pdata16bits = (uint16_t)(hlpuart->Instance->RDR & uhMask);
        pdata16bits++;
      }
      else
      {
        *pdata8bits = (uint8_t)(hlpuart->Instance->RDR & (uint8_t)uhMask);
        pdata8bits++;
      }
      hlpuart->RxXferCount--;
    }

    /* At end of Rx process, restore hlpuart->RxState to Ready */
    hlpuart->RxState = HAL_LPUART_STATE_READY;

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Send an amount of data in interrupt mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be sent.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Transmit_IT(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Tx process is not already ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->pTxBuffPtr  = pData;
    hlpuart->TxXferSize  = Size;
    hlpuart->TxXferCount = Size;
    hlpuart->TxISR       = NULL;

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->gState = HAL_LPUART_STATE_BUSY_TX;

    /* Configure Tx interrupt processing */
    if (hlpuart->FifoMode == LPUART_FIFOMODE_ENABLE)
    {
      /* Set the Tx ISR function pointer according to the data word length */
      if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
      {
        hlpuart->TxISR = LPUART_TxISR_16BIT_FIFOEN;
      }
      else
      {
        hlpuart->TxISR = LPUART_TxISR_8BIT_FIFOEN;
      }

      __HAL_UNLOCK(hlpuart);

      /* Enable the TX FIFO threshold interrupt */
      SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_TXFTIE);
    }
    else
    {
      /* Set the Tx ISR function pointer according to the data word length */
      if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
      {
        hlpuart->TxISR = LPUART_TxISR_16BIT;
      }
      else
      {
        hlpuart->TxISR = LPUART_TxISR_8BIT;
      }

