Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
      __HAL_UNLOCK(hlpuart);

      /* Enable the Transmit Data Register Empty interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TXEIE);
    }

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Receive an amount of data in interrupt mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Receive_IT(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Rx process is not already ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->pRxBuffPtr  = pData;
    hlpuart->RxXferSize  = Size;
    hlpuart->RxXferCount = Size;
    hlpuart->RxISR       = NULL;

    /* Computation of LPUART mask to apply to RDR register */
    LPUART_MASK_COMPUTATION(hlpuart);

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->RxState = HAL_LPUART_STATE_BUSY_RX;

    /* Enable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Configure Rx interrupt processing*/
    if ((hlpuart->FifoMode == LPUART_FIFOMODE_ENABLE) && (Size >= hlpuart->NbRxDataToProcess))
    {
      /* Set the Rx ISR function pointer according to the data word length */
      if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
      {
        hlpuart->RxISR = LPUART_RxISR_16BIT_FIFOEN;
      }
      else
      {
        hlpuart->RxISR = LPUART_RxISR_8BIT_FIFOEN;
      }

      __HAL_UNLOCK(hlpuart);

      /* Enable the LPUART Parity Error interrupt and RX FIFO Threshold interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);
      SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_RXFTIE);
    }
    else
    {
      /* Set the Rx ISR function pointer according to the data word length */
      if ((hlpuart->Init.WordLength == LPUART_WORDLENGTH_9B) && (hlpuart->Init.Parity == LPUART_PARITY_NONE))
      {
        hlpuart->RxISR = LPUART_RxISR_16BIT;
      }
      else
      {
        hlpuart->RxISR = LPUART_RxISR_8BIT;
      }

      __HAL_UNLOCK(hlpuart);

      /* Enable the LPUART Parity Error interrupt and Data Register Not Empty interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE | LPUART_CR1_RXNEIE);
    }

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Send an amount of data in DMA mode.
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be sent.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Transmit_DMA(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Tx process is not already ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

    __HAL_LOCK(hlpuart);

    hlpuart->pTxBuffPtr  = pData;
    hlpuart->TxXferSize  = Size;
    hlpuart->TxXferCount = Size;

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->gState = HAL_LPUART_STATE_BUSY_TX;

    if (hlpuart->hdmatx != NULL)
    {
      /* Set the LPUART DMA transfer complete callback */
      hlpuart->hdmatx->XferCpltCallback = LPUART_DMATransmitCplt;

      /* Set the LPUART DMA Block transfer complete callback */
      hlpuart->hdmatx->XferBlockCpltCallback = LPUART_DMATxBlockCplt;

      /* Set the LPUART DMA Half Block transfer complete callback */
      hlpuart->hdmatx->XferHalfBlockCpltCallback = LPUART_DMATxHalfBlockCplt;

      /* Set the LPUART DMA Source transfer complete callback */
      hlpuart->hdmatx->XferSrcTranCpltCallback = LPUART_DMASrcTranCplt;

      /* Set the DMA error callback */
      hlpuart->hdmatx->XferErrorCallback = LPUART_DMAError;

      /* Set the DMA abort callback */
      hlpuart->hdmatx->XferAbortCallback = NULL;

      /* Enable the LPUART transmit DMA channel */
      if (HAL_DMA_Start_IT(hlpuart->hdmatx, (uint32_t)hlpuart->pTxBuffPtr, (uint32_t)&hlpuart->Instance->TDR, Size) != HAL_OK)
      {
        /* Set error code to DMA */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

        __HAL_UNLOCK(hlpuart);

        /* Restore hlpuart->gState to ready */
        hlpuart->gState = HAL_LPUART_STATE_READY;

        return HAL_ERROR;
      }
    }
    /* Clear the TC flag in the ICR register */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_TCF);

    __HAL_UNLOCK(hlpuart);

    /* Enable the DMA transfer for transmit request by setting the DMAT bit
    in the LPUART CR3 register */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Receive an amount of data in DMA mode.
  * @note   When the LPUART parity is enabled (PCE = 1), the received data contain
  *         the parity bit (MSB position).
  * @note   When LPUART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @param hlpuart LPUART handle.
  * @param pData Pointer to data buffer (u8 or u16 data elements).
  * @param Size  Amount of data elements (u8 or u16 or u32) to be received.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Receive_DMA(LPUART_HandleTypeDef *hlpuart, uint8_t *pData, uint32_t Size)
{
  /* Check that a Rx process is not already ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_READY)
  {
    if ((pData == NULL) || (Size == 0U))
    {
      return HAL_ERROR;
    }

