Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
    __HAL_LOCK(hlpuart);

    hlpuart->pRxBuffPtr = pData;
    hlpuart->RxXferSize = Size;

    hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
    hlpuart->RxState = HAL_LPUART_STATE_BUSY_RX;

    if (hlpuart->hdmarx != NULL)
    {
      /* Set the LPUART DMA transfer complete callback */
      hlpuart->hdmarx->XferCpltCallback = LPUART_DMAReceiveCplt;

      /* Set the LPUART DMA Block transfer complete callback */   
      hlpuart->hdmarx->XferBlockCpltCallback = LPUART_DMARxBlockCplt;

      /* Set the LPUART DMA Half Block transfer complete callback */
      hlpuart->hdmarx->XferHalfBlockCpltCallback = LPUART_DMARxHalfBlockCplt;

      /* Set the LPUART DMA Destination transfer complete callback */
      hlpuart->hdmarx->XferDstTranCpltCallback = LPUART_DMADstTranCplt;

      /* Set the DMA error callback */
      hlpuart->hdmarx->XferErrorCallback = LPUART_DMAError;

      /* Set the DMA abort callback */
      hlpuart->hdmarx->XferAbortCallback = NULL;

      /* Enable the DMA channel */
      if (HAL_DMA_Start_IT(hlpuart->hdmarx, (uint32_t)&hlpuart->Instance->RDR, (uint32_t)hlpuart->pRxBuffPtr, Size) != HAL_OK)
      {
        /* Set error code to DMA */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

        __HAL_UNLOCK(hlpuart);

        /* Restore hlpuart->gState to ready */
        hlpuart->gState = HAL_LPUART_STATE_READY;

        return HAL_ERROR;
      }
    }
    __HAL_UNLOCK(hlpuart);

    /* Enable the LPUART Parity Error Interrupt */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);

    /* Enable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Enable the DMA transfer for the receiver request by setting the DMAR bit
    in the LPUART CR3 register */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief Pause the DMA Transfer.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_DMAPause(LPUART_HandleTypeDef *hlpuart)
{
  const HAL_LPUART_StateTypeDef gstate = hlpuart->gState;
  const HAL_LPUART_StateTypeDef rxstate = hlpuart->RxState;

  __HAL_LOCK(hlpuart);

  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT)) &&
      (gstate == HAL_LPUART_STATE_BUSY_TX))
  {
    /* Disable the LPUART DMA Tx request */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);
  }
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) &&
      (rxstate == HAL_LPUART_STATE_BUSY_RX))
  {
    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Disable the LPUART DMA Rx request */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);
  }

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief Resume the DMA Transfer.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_DMAResume(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);

  if (hlpuart->gState == HAL_LPUART_STATE_BUSY_TX)
  {
    /* Enable the LPUART DMA Tx request */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);
  }
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    /* Clear the Overrun flag before resuming the Rx transfer */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF);

    /* Re-enable PE and ERR (Frame error, noise error, overrun error) interrupts */
    SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Enable the LPUART DMA Rx request */
    SET_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);
  }

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief Stop the DMA Transfer.
  * @param hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_DMAStop(LPUART_HandleTypeDef *hlpuart)
{
  /* The Lock is not implemented on this API to allow the user application
     to call the HAL LPUART API under callbacks 
     HAL_LPUART_TxCpltCallback()        / HAL_LPUART_RxCpltCallback()        /
     HAL_LPUART_TxBlockCpltCallback     / HAL_LPUART_RxBlokCpltCallback      /
     HAL_LPUART_TxHalfBlockCpltCallback / HAL_LPUART_RxHalfBlockCpltCallback /
     HAL_LPUART_TxSrcCpltCallback       / HAL_LPUART_RxDstCpltCallback:
     indeed, when HAL_DMA_Abort() API is called, the DMA TX/RX Transfer or Half Transfer complete
     interrupt is generated if the DMA transfer interruption occurs at the middle or at the end of
     the stream and the corresponding call back is executed. */

  const HAL_LPUART_StateTypeDef gstate = hlpuart->gState;
  const HAL_LPUART_StateTypeDef rxstate = hlpuart->RxState;

  /* Stop LPUART DMA Tx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT)) &&
      (gstate == HAL_LPUART_STATE_BUSY_TX))
  {
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Abort the LPUART DMA Tx channel */
    if (hlpuart->hdmatx != NULL)
    {
      if (HAL_DMA_Abort(hlpuart->hdmatx) != HAL_OK)
      {
        if (HAL_DMA_GetError(hlpuart->hdmatx) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

          return HAL_TIMEOUT;
        }
      }
    }

    LPUART_EndTxTransfer(hlpuart);
  }

  /* Stop LPUART DMA Rx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) &&
      (rxstate == HAL_LPUART_STATE_BUSY_RX))
  {
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* Abort the LPUART DMA Rx channel */
    if (hlpuart->hdmarx != NULL)
    {
      if (HAL_DMA_Abort(hlpuart->hdmarx) != HAL_OK)
      {
        if (HAL_DMA_GetError(hlpuart->hdmarx) == HAL_DMA_ERROR_TIMEOUT)
        {
          /* Set error code to DMA */
          hlpuart->ErrorCode = HAL_LPUART_ERROR_DMA;

          return HAL_TIMEOUT;
        }
      }
    }

    LPUART_EndRxTransfer(hlpuart);
  }

  return HAL_OK;
}

/**
  * @brief  Abort ongoing transfers (blocking mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Tx and Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort (in case of transfer in DMA mode)
  *           - Set handle State to READY
  * @note   This procedure is executed in blocking mode : when exiting function, Abort is considered as completed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_Abort(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable TXE, TC, RXNE, PE, RXFT, TXFT and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE | LPUART_CR1_TXEIE | LPUART_CR1_TCIE));
  CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE | LPUART_CR3_RXFTIE | LPUART_CR3_TXFTIE);

