Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* Disable the LPUART DMA Tx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT))
  {
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAT);

    /* Abort the LPUART DMA Tx channel : use non blocking DMA Abort API (callback) */
    if (hlpuart->hdmatx != NULL)
    {
      /* Set the LPUART DMA Abort callback :
         will lead to call HAL_LPUART_AbortCpltCallback() at end of DMA abort procedure */
      hlpuart->hdmatx->XferAbortCallback = LPUART_DMATxOnlyAbortCallback;

      /* Abort DMA TX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmatx) != HAL_OK)
      {
        /* Call Directly hlpuart->hdmatx->XferAbortCallback function in case of error */
        hlpuart->hdmatx->XferAbortCallback(hlpuart->hdmatx);
      }
    }
    else
    {
      /* Reset Tx transfer counter */
      hlpuart->TxXferCount = 0U;

      /* Clear TxISR function pointers */
      hlpuart->TxISR = NULL;

      /* Restore hlpuart->gState to Ready */
      hlpuart->gState = HAL_LPUART_STATE_READY;

      /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /* Call registered Abort Transmit Complete Callback */
      hlpuart->AbortTransmitCpltCallback(hlpuart);
#else
      /* Call legacy weak Abort Transmit Complete Callback */
      HAL_LPUART_AbortTransmitCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Reset Tx transfer counter */
    hlpuart->TxXferCount = 0U;

    /* Clear TxISR function pointers */
    hlpuart->TxISR = NULL;

    /* Flush the whole TX FIFO (if needed) */
    if (hlpuart->FifoMode == LPUART_FIFOMODE_ENABLE)
    {
      __HAL_LPUART_SEND_REQ(hlpuart, LPUART_TXDATA_FLUSH_REQUEST);
    }

    /* Restore hlpuart->gState to Ready */
    hlpuart->gState = HAL_LPUART_STATE_READY;

    /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort Transmit Complete Callback */
    hlpuart->AbortTransmitCpltCallback(hlpuart);
#else
    /* Call legacy weak Abort Transmit Complete Callback */
    HAL_LPUART_AbortTransmitCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Abort ongoing Receive transfer (Interrupt mode).
  * @param  hlpuart LPUART handle.
  * @note   This procedure could be used for aborting any ongoing Rx transfer started in Interrupt or DMA mode.
  *         This procedure performs following operations :
  *           - Disable LPUART Interrupts (Rx)
  *           - Disable the DMA transfer in the peripheral register (if enabled)
  *           - Abort DMA transfer by calling HAL_DMA_Abort_IT (in case of transfer in DMA mode)
  *           - Set handle State to READY
  *           - At abort completion, call user abort complete callback
  * @note   This procedure is executed in Interrupt mode, meaning that abort procedure could be
  *         considered as completed only when user abort complete callback is executed (not when exiting function).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_AbortReceive_IT(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_PEIE | LPUART_CR1_RXNEIE));
  CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE | LPUART_CR3_RXFTIE));

  /* Disable the LPUART DMA Rx request if enabled */
  if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
  {
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* Abort the LPUART DMA Rx channel : use non blocking DMA Abort API (callback) */
    if (hlpuart->hdmarx != NULL)
    {
      /* Set the LPUART DMA Abort callback :
         will lead to call HAL_LPUART_AbortCpltCallback() at end of DMA abort procedure */
      hlpuart->hdmarx->XferAbortCallback = LPUART_DMARxOnlyAbortCallback;

      /* Abort DMA RX */
      if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
      {
        /* Call Directly hlpuart->hdmarx->XferAbortCallback function in case of error */
        hlpuart->hdmarx->XferAbortCallback(hlpuart->hdmarx);
      }
    }
    else
    {
      /* Reset Rx transfer counter */
      hlpuart->RxXferCount = 0U;

      /* Clear RxISR function pointer */
      hlpuart->pRxBuffPtr = NULL;

      /* Clear the Error flags in the ICR register */
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

      /* Discard the received data */
      __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);

      /* Restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /* Call registered Abort Receive Complete Callback */
      hlpuart->AbortReceiveCpltCallback(hlpuart);
#else
      /* Call legacy weak Abort Receive Complete Callback */
      HAL_LPUART_AbortReceiveCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Reset Rx transfer counter */
    hlpuart->RxXferCount = 0U;

    /* Clear RxISR function pointer */
    hlpuart->pRxBuffPtr = NULL;

    /* Clear the Error flags in the ICR register */
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

    /* Restore hlpuart->RxState to Ready */
    hlpuart->RxState = HAL_LPUART_STATE_READY;

    /* As no DMA to be aborted, call directly user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Abort Receive Complete Callback */
    hlpuart->AbortReceiveCpltCallback(hlpuart);
#else
    /* Call legacy weak Abort Receive Complete Callback */
    HAL_LPUART_AbortReceiveCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief Handle LPUART interrupt request.
  * @param hlpuart LPUART handle.
  * @retval None
  */
void HAL_LPUART_IRQHandler(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t isrflags   = READ_REG(hlpuart->Instance->ISR);
  uint32_t cr1its     = READ_REG(hlpuart->Instance->CR1);
  uint32_t cr3its     = READ_REG(hlpuart->Instance->CR3);

  uint32_t errorflags;
  uint32_t errorcode;

  /* If no error occurs */
  errorflags = (isrflags & (uint32_t)(LPUART_ISR_PE | LPUART_ISR_FE | LPUART_ISR_ORE | LPUART_ISR_NE));
  if (errorflags == 0U)
  {
    /* LPUART in mode Receiver ---------------------------------------------------*/
    if (((isrflags & LPUART_ISR_RXNE) != 0U)
        && (((cr1its & LPUART_CR1_RXNEIE) != 0U)
          || ((cr3its & LPUART_CR3_RXFTIE) != 0U)))
    {
      if (hlpuart->RxISR != NULL)
      {
        hlpuart->RxISR(hlpuart);
      }
      return;
    }
  }

  /* If some errors occur */
  if ((errorflags != 0U)
      && ((((cr3its & (LPUART_CR3_RXFTIE | LPUART_CR3_EIE)) != 0U)
           || ((cr1its & (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE)) != 0U))))
  {
    /* LPUART parity error interrupt occurred -------------------------------------*/
    if (((isrflags & LPUART_ISR_PE) != 0U) && ((cr1its & LPUART_CR1_PEIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_PEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_PE;
    }

