Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
    /* LPUART frame error interrupt occurred --------------------------------------*/
    if (((isrflags & LPUART_ISR_FE) != 0U) && ((cr3its & LPUART_CR3_EIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_FEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_FE;
    }

    /* LPUART noise error interrupt occurred --------------------------------------*/
    if (((isrflags & LPUART_ISR_NE) != 0U) && ((cr3its & LPUART_CR3_EIE) != 0U))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_NEF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_NE;
    }

    /* LPUART Over-Run interrupt occurred -----------------------------------------*/
    if (((isrflags & LPUART_ISR_ORE) != 0U)
        && (((cr1its & LPUART_CR1_RXNEIE) != 0U) ||
            ((cr3its & (LPUART_CR3_RXFTIE | LPUART_CR3_EIE)) != 0U)))
    {
      __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF);

      hlpuart->ErrorCode |= HAL_LPUART_ERROR_ORE;
    }

    /* Call LPUART Error Call back function if need be ----------------------------*/
    if (hlpuart->ErrorCode != HAL_LPUART_ERROR_NONE)
    {
      /* LPUART in mode Receiver --------------------------------------------------*/
      if (((isrflags & LPUART_ISR_RXNE) != 0U)
          && (((cr1its & LPUART_CR1_RXNEIE) != 0U)
              || ((cr3its & LPUART_CR3_RXFTIE) != 0U)))
      {
        if (hlpuart->RxISR != NULL)
        {
          hlpuart->RxISR(hlpuart);
        }
      }

      /* If Error is to be considered as blocking :
          - Receiver Timeout error in Reception
          - Overrun error in Reception
          - any error occurs in DMA mode reception
      */
      errorcode = hlpuart->ErrorCode;
      if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) ||
          ((errorcode & (HAL_LPUART_ERROR_RTO | HAL_LPUART_ERROR_ORE)) != 0U))
      {
        /* Blocking error : transfer is aborted
           Set the LPUART state ready to be able to start again the process,
           Disable Rx Interrupts, and disable Rx DMA request, if ongoing */
        LPUART_EndRxTransfer(hlpuart);

        /* Disable the LPUART DMA Rx request if enabled */
        if (HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR))
        {
          CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

          /* Abort the LPUART DMA Rx channel */
          if (hlpuart->hdmarx != NULL)
          {
            /* Set the LPUART DMA Abort callback :
               will lead to call HAL_LPUART_ErrorCallback() at end of DMA abort procedure */
            hlpuart->hdmarx->XferAbortCallback = LPUART_DMAAbortOnError;

            /* Abort DMA RX */
            if (HAL_DMA_Abort_IT(hlpuart->hdmarx) != HAL_OK)
            {
              /* Call Directly hlpuart->hdmarx->XferAbortCallback function in case of error */
              hlpuart->hdmarx->XferAbortCallback(hlpuart->hdmarx);
            }
          }
          else
          {
            /* Call user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
            /*Call registered error callback*/
            hlpuart->ErrorCallback(hlpuart);
#else
            /*Call legacy weak error callback*/
            HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */

          }
        }
        else
        {
          /* Call user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
          /*Call registered error callback*/
          hlpuart->ErrorCallback(hlpuart);
#else
          /*Call legacy weak error callback*/
          HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
        }
      }
      else
      {
        /* Non Blocking error : transfer could go on.
           Error is notified to user through user error callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
        /*Call registered error callback*/
        hlpuart->ErrorCallback(hlpuart);
#else
        /*Call legacy weak error callback*/
        HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
        hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;
      }
    }
    return;

  } /* End if some error occurs */

  /* LPUART wakeup from Stop mode interrupt occurred ---------------------------*/
  if (((isrflags & LPUART_ISR_WUF) != 0U) && ((cr3its & LPUART_CR3_WUFIE) != 0U))
  {
    __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_WUF);

    /* LPUART Rx state is not reset as a reception process might be ongoing.
       If LPUART handle state fields need to be reset to READY, this could be done in Wakeup callback */

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Wakeup Callback */
    hlpuart->WakeupCallback(hlpuart);
#else
    /* Call legacy weak Wakeup Callback */
    HAL_LPUARTEx_WakeupCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    return;
  }

  /* LPUART in mode Transmitter ------------------------------------------------*/
  if (((isrflags & LPUART_ISR_TXE) != 0U)
      && (((cr1its & LPUART_CR1_TXEIE) != 0U)
          || ((cr3its & LPUART_CR3_TXFTIE) != 0U)))
  {
    if (hlpuart->TxISR != NULL)
    {
      hlpuart->TxISR(hlpuart);
    }
    return;
  }

  /* LPUART in mode Transmitter (transmission end) -----------------------------*/
  if (((isrflags & LPUART_ISR_TC) != 0U) && ((cr1its & LPUART_CR1_TCIE) != 0U))
  {
    LPUART_EndTransmit_IT(hlpuart);
    return;
  }

  /* LPUART TX Fifo Empty occurred ----------------------------------------------*/
  if (((isrflags & LPUART_ISR_TXFE) != 0U) && ((cr1its & LPUART_CR1_TXFEIE) != 0U))
  {
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Tx Fifo Empty Callback */
    hlpuart->TxFifoEmptyCallback(hlpuart);
#else
    /* Call legacy weak Tx Fifo Empty Callback */
    HAL_LPUARTEx_TxFifoEmptyCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    return;
  }

  /* LPUART RX Fifo Full occurred ----------------------------------------------*/
  if (((isrflags & LPUART_ISR_RXFF) != 0U) && ((cr1its & LPUART_CR1_RXFFIE) != 0U))
  {
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
    /* Call registered Rx Fifo Full Callback */
    hlpuart->RxFifoFullCallback(hlpuart);
#else
    /* Call legacy weak Rx Fifo Full Callback */
    HAL_LPUARTEx_RxFifoFullCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    return;
  }
}

/**
  * @brief Tx Transfer completed callback.
  * @param hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_TxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Tx Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_TxBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Tx Half Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxHalfBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_TxHalfBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Tx Source Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_TxSrcCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_TxSrcCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_RxCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_RxBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Half Block Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxHalfBlockCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_RxHalfBlockCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  Rx Destination Transfer completed callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_RxDstCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_LPUART_RxDstCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART error callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_ErrorCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortTransmitCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortTransmitCpltCallback can be implemented in the user file.
   */
}

/**
  * @brief  LPUART Abort Receive Complete callback.
  * @param  hlpuart LPUART handle.
  * @retval None
  */
__weak void HAL_LPUART_AbortReceiveCpltCallback(LPUART_HandleTypeDef *hlpuart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hlpuart);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_LPUART_AbortReceiveCpltCallback can be implemented in the user file.
   */
}

/**
  * @}
  */

/** @defgroup LPUART_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   LPUART control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the LPUART.
     (+) HAL_MultiProcessor_EnableMuteMode() API enables mute mode
     (+) HAL_MultiProcessor_DisableMuteMode() API disables mute mode
     (+) HAL_MultiProcessor_EnterMuteMode() API enters mute mode
     (+) LPUART_SetConfig() API configures the LPUART peripheral
     (+) LPUART_AdvFeatureConfig() API optionally configures the LPUART advanced features
     (+) LPUART_CheckIdleState() API ensures that TEACK and/or REACK are set after initialization
     (+) HAL_LPUART_HalfDuplex_EnableTransmitter() API disables receiver and enables transmitter
     (+) HAL_LPUART_HalfDuplex_EnableReceiver() API disables transmitter and enables receiver
@endverbatim
  * @{
  */

/**
  * @brief  Enable LPUART in mute mode (does not mean LPUART enters mute mode;
  *         to enter mute mode, HAL_MultiProcessor_EnterMuteMode() API must be called).
  * @param  hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_MultiProcessor_EnableMuteMode(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);

  hlpuart->gState = HAL_LPUART_STATE_BUSY;

