Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* Enable LPUART mute mode by setting the MME bit in the CR1 register */
  SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_MME);

  hlpuart->gState = HAL_LPUART_STATE_READY;

  return (LPUART_CheckIdleState(hlpuart));
}

/**
  * @brief  Disable LPUART mute mode (does not mean the LPUART actually exits mute mode
  *         as it may not have been in mute mode at this very moment).
  * @param  hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_MultiProcessor_DisableMuteMode(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);

  hlpuart->gState = HAL_LPUART_STATE_BUSY;

  /* Disable LPUART mute mode by clearing the MME bit in the CR1 register */
  CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_MME);

  hlpuart->gState = HAL_LPUART_STATE_READY;

  return (LPUART_CheckIdleState(hlpuart));
}

/**
  * @brief Enter LPUART mute mode (means LPUART actually enters mute mode).
  * @note  To exit from mute mode, HAL_MultiProcessor_DisableMuteMode() API must be called.
  * @param hlpuart LPUART handle.
  * @retval None
  */
void HAL_LPUART_MultiProcessor_EnterMuteMode(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LPUART_SEND_REQ(hlpuart, LPUART_MUTE_MODE_REQUEST);
}

/**
  * @brief  Enable the LPUART transmitter and disable the LPUART receiver.
  * @param  hlpuart LPUART handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPUART_HalfDuplex_EnableTransmitter(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);
  hlpuart->gState = HAL_LPUART_STATE_BUSY;

  /* Clear TE and RE bits */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TE | LPUART_CR1_RE));

  /* Enable the LPUART's transmit interface by setting the TE bit in the LPUART CR1 register */
  SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TE);

  hlpuart->gState = HAL_LPUART_STATE_READY;

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @brief  Enable the LPUART receiver and disable the LPUART transmitter.
  * @param  hlpuart LPUART handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_LPUART_HalfDuplex_EnableReceiver(LPUART_HandleTypeDef *hlpuart)
{
  __HAL_LOCK(hlpuart);
  hlpuart->gState = HAL_LPUART_STATE_BUSY;

  /* Clear TE and RE bits */
  CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_TE | LPUART_CR1_RE));

  /* Enable the LPUART's receive interface by setting the RE bit in the LPUART CR1 register */
  SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_RE);

  hlpuart->gState = HAL_LPUART_STATE_READY;

  __HAL_UNLOCK(hlpuart);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup LPUART_Exported_Functions_Group4 Peripheral State and Error functions
  *  @brief   LPUART Peripheral State functions
  *
@verbatim
  ==============================================================================
            ##### Peripheral State and Error functions #####
  ==============================================================================
    [..]
    This subsection provides functions allowing to :
      (+) Return the LPUART handle state.
      (+) Return the LPUART handle error code

@endverbatim
  * @{
  */

/**
  * @brief Return the LPUART handle state.
  * @param  hlpuart Pointer to a LPUART_HandleTypeDef structure that contains
  *               the configuration information for the specified LPUART.
  * @retval HAL state
  */
HAL_LPUART_StateTypeDef HAL_LPUART_GetState(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t temp1;
  uint32_t temp2;
  temp1 = hlpuart->gState;
  temp2 = hlpuart->RxState;

  return (HAL_LPUART_StateTypeDef)(temp1 | temp2);
}

/**
  * @brief  Return the LPUART handle error code.
  * @param  hlpuart Pointer to a LPUART_HandleTypeDef structure that contains
  *               the configuration information for the specified LPUART.
  * @retval LPUART Error Code
  */
uint32_t HAL_LPUART_GetError(LPUART_HandleTypeDef *hlpuart)
{
  return hlpuart->ErrorCode;
}
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup LPUART_Private_Functions LPUART Private Functions
  * @{
  */

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
/**
  * @brief  Initialize the callbacks to their default values.
  * @param  hlpuart LPUART handle.
  * @retval none
  */
void LPUART_InitCallbacksToDefault(LPUART_HandleTypeDef *hlpuart)
{
  /* Init the LPUART Callback settings */
  hlpuart->TxBlockCpltCallback       = HAL_LPUART_TxBlockCpltCallback;       /* Legacy weak TxBlockCpltCallback       */
  hlpuart->TxHalfBlockCpltCallback   = HAL_LPUART_TxHalfBlockCpltCallback;   /* Legacy weak TxHalfBlockCpltCallback   */
  hlpuart->TxSrcCpltCallback         = HAL_LPUART_TxSrcCpltCallback;         /* Legacy weak TxSrcCpltCallback         */
  hlpuart->TxCpltCallback            = HAL_LPUART_TxCpltCallback;            /* Legacy weak TxCpltCallback            */
  hlpuart->RxBlockCpltCallback       = HAL_LPUART_RxBlockCpltCallback;       /* Legacy weak RxBlockCpltCallback       */
  hlpuart->RxHalfBlockCpltCallback   = HAL_LPUART_RxHalfBlockCpltCallback;   /* Legacy weak RxHalfBlockCpltCallback   */
  hlpuart->RxDstCpltCallback         = HAL_LPUART_RxDstCpltCallback;         /* Legacy weak RxDstCpltCallback         */
  hlpuart->RxCpltCallback            = HAL_LPUART_RxCpltCallback;            /* Legacy weak RxCpltCallback            */
  hlpuart->ErrorCallback             = HAL_LPUART_ErrorCallback;             /* Legacy weak ErrorCallback             */
  hlpuart->AbortCpltCallback         = HAL_LPUART_AbortCpltCallback;         /* Legacy weak AbortCpltCallback         */
  hlpuart->AbortTransmitCpltCallback = HAL_LPUART_AbortTransmitCpltCallback; /* Legacy weak AbortTransmitCpltCallback */
  hlpuart->AbortReceiveCpltCallback  = HAL_LPUART_AbortReceiveCpltCallback;  /* Legacy weak AbortReceiveCpltCallback  */
  hlpuart->WakeupCallback            = HAL_LPUARTEx_WakeupCallback;          /* Legacy weak WakeupCallback            */
  hlpuart->RxFifoFullCallback        = HAL_LPUARTEx_RxFifoFullCallback;      /* Legacy weak RxFifoFullCallback        */
  hlpuart->TxFifoEmptyCallback       = HAL_LPUARTEx_TxFifoEmptyCallback;     /* Legacy weak TxFifoEmptyCallback       */

