Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* DMA Normal mode */
  if (HAL_IS_BIT_CLR(hdma->Init.Mode, DMA_CIRCULAR))
  {
    hlpuart->RxXferCount = 0U;

    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

    /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
       in the LPUART CR3 register */
    CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_DMAR);

    /* At end of Rx process, restore hlpuart->RxState to Ready */
    hlpuart->RxState = HAL_LPUART_STATE_READY;
  }

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx complete callback*/
  hlpuart->RxCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx complete callback*/
  HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx Block complete callback*/
  hlpuart->RxBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx Block complete callback*/
  HAL_LPUART_RxBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process half block complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx Half Block complete callback*/
  hlpuart->RxHalfBlockCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx Half Block complete callback*/
  HAL_LPUART_RxHalfBlockCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART receive process destination complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMADstTranCplt(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Rx destination complete callback*/
  hlpuart->RxDstCpltCallback(hlpuart);
#else
  /*Call legacy weak Rx destination complete callback*/
  HAL_LPUART_RxDstCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief DMA LPUART communication error callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAError(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  const HAL_LPUART_StateTypeDef gstate = hlpuart->gState;
  const HAL_LPUART_StateTypeDef rxstate = hlpuart->RxState;

  /* Stop LPUART DMA Tx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAT)) &&
      (gstate == HAL_LPUART_STATE_BUSY_TX))
  {
    hlpuart->TxXferCount = 0U;
    LPUART_EndTxTransfer(hlpuart);
  }

  /* Stop LPUART DMA Rx request if ongoing */
  if ((HAL_IS_BIT_SET(hlpuart->Instance->CR3, LPUART_CR3_DMAR)) &&
      (rxstate == HAL_LPUART_STATE_BUSY_RX))
  {
    hlpuart->RxXferCount = 0U;
    LPUART_EndRxTransfer(hlpuart);
  }

  hlpuart->ErrorCode |= HAL_LPUART_ERROR_DMA;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered error callback*/
  hlpuart->ErrorCallback(hlpuart);
#else
  /*Call legacy weak error callback*/
  HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LPUART communication abort callback, when initiated by HAL services on Error
  *         (To be called at end of DMA Abort procedure following error occurrence).
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMAAbortOnError(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);
  hlpuart->RxXferCount = 0U;
  hlpuart->TxXferCount = 0U;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered error callback*/
  hlpuart->ErrorCallback(hlpuart);
#else
  /*Call legacy weak error callback*/
  HAL_LPUART_ErrorCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LPUART Tx communication abort callback, when initiated by user
  *         (To be called at end of DMA Tx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Rx DMA Handle.
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxAbortCallback(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  hlpuart->hdmatx->XferAbortCallback = NULL;

  /* Check if an Abort process is still ongoing */
  if (hlpuart->hdmarx != NULL)
  {
    if (hlpuart->hdmarx->XferAbortCallback != NULL)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  hlpuart->TxXferCount = 0U;
  hlpuart->RxXferCount = 0U;

  /* Reset errorCode */
  hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;

  /* Clear the Error flags in the ICR register */
  __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

  /* Flush the whole TX FIFO (if needed) */
  if (hlpuart->FifoMode == LPUART_FIFOMODE_ENABLE)
  {
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_TXDATA_FLUSH_REQUEST);
  }

  /* Restore hlpuart->gState and hlpuart->RxState to Ready */
  hlpuart->gState  = HAL_LPUART_STATE_READY;
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort complete callback */
  hlpuart->AbortCpltCallback(hlpuart);
#else
  /* Call legacy weak Abort complete callback */
  HAL_LPUART_AbortCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}


/**
  * @brief  DMA LPUART Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxAbortCallback(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

