Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  hlpuart->hdmarx->XferAbortCallback = NULL;

  /* Check if an Abort process is still ongoing */
  if (hlpuart->hdmatx != NULL)
  {
    if (hlpuart->hdmatx->XferAbortCallback != NULL)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  hlpuart->TxXferCount = 0U;
  hlpuart->RxXferCount = 0U;

  /* Reset errorCode */
  hlpuart->ErrorCode = HAL_LPUART_ERROR_NONE;

  /* Clear the Error flags in the ICR register */
  __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

  /* Discard the received data */
  __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);

  /* Restore hlpuart->gState and hlpuart->RxState to Ready */
  hlpuart->gState  = HAL_LPUART_STATE_READY;
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort complete callback */
  hlpuart->AbortCpltCallback(hlpuart);
#else
  /* Call legacy weak Abort complete callback */
  HAL_LPUART_AbortCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}


/**
  * @brief  DMA LPUART Tx communication abort callback, when initiated by user by a call to
  *         HAL_LPUART_AbortTransmit_IT API (Abort only Tx transfer)
  *         (This callback is executed at end of DMA Tx Abort procedure following user abort request,
  *         and leads to user Tx Abort Complete callback execution).
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMATxOnlyAbortCallback(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)(hdma->Parent);

  hlpuart->TxXferCount = 0U;

  /* Flush the whole TX FIFO (if needed) */
  if (hlpuart->FifoMode == LPUART_FIFOMODE_ENABLE)
  {
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_TXDATA_FLUSH_REQUEST);
  }

  /* Restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Transmit Complete Callback */
  hlpuart->AbortTransmitCpltCallback(hlpuart);
#else
  /* Call legacy weak Abort Transmit Complete Callback */
  HAL_LPUART_AbortTransmitCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA LPUART Rx communication abort callback, when initiated by user by a call to
  *         HAL_LPUART_AbortReceive_IT API (Abort only Rx transfer)
  *         (This callback is executed at end of DMA Rx Abort procedure following user abort request,
  *         and leads to user Rx Abort Complete callback execution).
  * @param  hdma DMA handle.
  * @retval None
  */
static void LPUART_DMARxOnlyAbortCallback(DMA_HandleTypeDef *hdma)
{
  LPUART_HandleTypeDef *hlpuart = (LPUART_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  hlpuart->RxXferCount = 0U;

  /* Clear the Error flags in the ICR register */
  __HAL_LPUART_CLEAR_FLAG(hlpuart, LPUART_CLEAR_OREF | LPUART_CLEAR_NEF | LPUART_CLEAR_PEF | LPUART_CLEAR_FEF);

  /* Discard the received data */
  __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);

  /* Restore hlpuart->RxState to Ready */
  hlpuart->RxState = HAL_LPUART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Receive Complete Callback */
  hlpuart->AbortReceiveCpltCallback(hlpuart);
#else
  /* Call legacy weak Abort Receive Complete Callback */
  HAL_LPUART_AbortReceiveCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief TX interrupt handler for 7 or 8 bits data word length .
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Transmit_IT().
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_TxISR_8BIT(LPUART_HandleTypeDef *hlpuart)
{
  /* Check that a Tx process is ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_BUSY_TX)
  {
    if (hlpuart->TxXferCount == 0U)
    {
      /* Disable the LPUART Transmit Data Register Empty Interrupt */
      CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_TXEIE);

      /* Enable the LPUART Transmit Complete Interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);
    }
    else
    {
      /* To prevent the TC flag bit from being affected by other operations 
         during data transmission, clear the TC flag bit in advance. 
         */
      __HAL_LPUART_CLEAR_IT(hlpuart, LPUART_CLEAR_TCF);
      hlpuart->Instance->TDR = (uint8_t)(*hlpuart->pTxBuffPtr & (uint8_t)0xFF);
      hlpuart->pTxBuffPtr++;
      hlpuart->TxXferCount--;
    }
  }
}

/**
  * @brief TX interrupt handler for 9 bits data word length.
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Transmit_IT().
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_TxISR_16BIT(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t *tmp;

  /* Check that a Tx process is ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_BUSY_TX)
  {
    if (hlpuart->TxXferCount == 0U)
    {
      /* Disable the LPUART Transmit Data Register Empty Interrupt */
      CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_TXEIE);

      /* Enable the LPUART Transmit Complete Interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);
    }
    else
    {
      tmp = (uint16_t *) hlpuart->pTxBuffPtr;
      /* To prevent the TC flag bit from being affected by other operations 
         during data transmission, clear the TC flag bit in advance. 
         */
      __HAL_LPUART_CLEAR_IT(hlpuart, LPUART_CLEAR_TCF);
      hlpuart->Instance->TDR = (((uint32_t)(*tmp)) & 0x01FFUL);
      hlpuart->pTxBuffPtr += 2U;
      hlpuart->TxXferCount--;
    }
  }
}

/**
  * @brief TX interrupt handler for 7 or 8 bits data word length and FIFO mode is enabled.
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Transmit_IT().
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_TxISR_8BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart)
{
  uint32_t  nb_tx_data;

