Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* Check that a Tx process is ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_BUSY_TX)
  {
    for (nb_tx_data = hlpuart->NbTxDataToProcess ; nb_tx_data > 0U ; nb_tx_data--)
    {
      if (hlpuart->TxXferCount == 0U)
      {
        /* Disable the TX FIFO threshold interrupt */
        CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_TXFTIE);

        /* Enable the LPUART Transmit Complete Interrupt */
        SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);

        break; /* force exit loop */
      }
      else if (READ_BIT(hlpuart->Instance->ISR, LPUART_ISR_TXE) != 0U)
      {
        /* To prevent the TC flag bit from being affected by other operations 
           during data transmission, clear the TC flag bit in advance. 
           */
        __HAL_LPUART_CLEAR_IT(hlpuart, LPUART_CLEAR_TCF);
        hlpuart->Instance->TDR = (uint8_t)(*hlpuart->pTxBuffPtr & (uint8_t)0xFF);
        hlpuart->pTxBuffPtr++;
        hlpuart->TxXferCount--;
      }
      else
      {
        /* Nothing to do */
      }
    }
  }
}

/**
  * @brief TX interrupt handler for 9 bits data word length and FIFO mode is enabled.
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Transmit_IT().
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_TxISR_16BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t *tmp;
  uint32_t  nb_tx_data;

  /* Check that a Tx process is ongoing */
  if (hlpuart->gState == HAL_LPUART_STATE_BUSY_TX)
  {
    for (nb_tx_data = hlpuart->NbTxDataToProcess ; nb_tx_data > 0U ; nb_tx_data--)
    {
      if (hlpuart->TxXferCount == 0U)
      {
        /* Disable the TX FIFO threshold interrupt */
        CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_TXFTIE);

        /* Enable the LPUART Transmit Complete Interrupt */
        SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);

        break; /* force exit loop */
      }
      else if (READ_BIT(hlpuart->Instance->ISR, LPUART_ISR_TXE) != 0U)
      {
        tmp = (uint16_t *) hlpuart->pTxBuffPtr;
        /* To prevent the TC flag bit from being affected by other operations 
           during data transmission, clear the TC flag bit in advance. 
           */
        __HAL_LPUART_CLEAR_IT(hlpuart, LPUART_CLEAR_TCF);
        hlpuart->Instance->TDR = (((uint32_t)(*tmp)) & 0x01FFUL);
        hlpuart->pTxBuffPtr += 2U;
        hlpuart->TxXferCount--;
      }
      else
      {
        /* Nothing to do */
      }
    }
  }
}

/**
  * @brief  Wrap up transmission in non-blocking mode.
  * @param  hlpuart pointer to a LPUART_HandleTypeDef structure that contains
  *                the configuration information for the specified LPUART module.
  * @retval None
  */
static void LPUART_EndTransmit_IT(LPUART_HandleTypeDef *hlpuart)
{
  /* Disable the LPUART Transmit Complete Interrupt */
  CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_TCIE);

  /* Tx process is ended, restore hlpuart->gState to Ready */
  hlpuart->gState = HAL_LPUART_STATE_READY;

  /* Cleat TxISR function pointer */
  hlpuart->TxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
  /*Call registered Tx complete callback*/
  hlpuart->TxCpltCallback(hlpuart);
#else
  /*Call legacy weak Tx complete callback*/
  HAL_LPUART_TxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
}

/**
  * @brief RX interrupt handler for 7 or 8 bits data word length .
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_8BIT(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t uhMask = hlpuart->Mask;
  uint16_t uhdata;

  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
    *hlpuart->pRxBuffPtr = (uint8_t)(uhdata & (uint8_t)uhMask);
    hlpuart->pRxBuffPtr++;
    hlpuart->RxXferCount--;

    if (hlpuart->RxXferCount == 0U)
    {
      /* Disable the LPUART Parity Error Interrupt and RXNE interrupts */
      CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));

      /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

      /* Rx process is completed, restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* Clear RxISR function pointer */
      hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /*Call registered Rx complete callback*/
      hlpuart->RxCpltCallback(hlpuart);
#else
      /*Call legacy weak Rx complete callback*/
      HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @brief RX interrupt handler for 9 bits data word length .
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Receive_IT()
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_16BIT(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t *tmp;
  uint16_t uhMask = hlpuart->Mask;
  uint16_t  uhdata;

  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
    tmp = (uint16_t *) hlpuart->pRxBuffPtr ;
    *tmp = (uint16_t)(uhdata & uhMask);
    hlpuart->pRxBuffPtr += 2U;
    hlpuart->RxXferCount--;

    if (hlpuart->RxXferCount == 0U)
    {
      /* Disable the LPUART Parity Error Interrupt and RXNE interrupt*/
      CLEAR_BIT(hlpuart->Instance->CR1, (LPUART_CR1_RXNEIE | LPUART_CR1_PEIE));

      /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error) */
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_EIE);

      /* Rx process is completed, restore hlpuart->RxState to Ready */
      hlpuart->RxState = HAL_LPUART_STATE_READY;

      /* Clear RxISR function pointer */
      hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
      /*Call registered Rx complete callback*/
      hlpuart->RxCpltCallback(hlpuart);
#else
      /*Call legacy weak Rx complete callback*/
      HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @brief RX interrupt handler for 7 or 8  bits data word length and FIFO mode is enabled.
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Receive_IT()
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_8BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t  uhMask = hlpuart->Mask;
  uint16_t  uhdata;
  uint32_t  nb_rx_data;
  uint32_t  rxdatacount;

