Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_lpuart.c
  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    for (nb_rx_data = hlpuart->NbRxDataToProcess ; nb_rx_data > 0U ; nb_rx_data--)
    {
      uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
      *hlpuart->pRxBuffPtr = (uint8_t)(uhdata & (uint8_t)uhMask);
      hlpuart->pRxBuffPtr++;
      hlpuart->RxXferCount--;

      if (hlpuart->RxXferCount == 0U)
      {
        /* Disable the LPUART Parity Error Interrupt and RXFT interrupt*/
        CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);

        /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error)
           and RX FIFO Threshold interrupt */
        CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE | LPUART_CR3_RXFTIE));

        /* Rx process is completed, restore hlpuart->RxState to Ready */
        hlpuart->RxState = HAL_LPUART_STATE_READY;

        /* Clear RxISR function pointer */
        hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
        /*Call registered Rx complete callback*/
        hlpuart->RxCpltCallback(hlpuart);
#else
        /*Call legacy weak Rx complete callback*/
        HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rxdatacount = hlpuart->RxXferCount;
    if ((rxdatacount != 0U) && (rxdatacount < hlpuart->NbRxDataToProcess))
    {
      /* Disable the LPUART RXFT interrupt*/
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_RXFTIE);

      /* Update the RxISR function pointer */
      hlpuart->RxISR = LPUART_RxISR_8BIT;

      /* Enable the LPUART Data Register Not Empty interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_RXNEIE);
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @brief RX interrupt handler for 9 bits data word length and FIFO mode is enabled.
  * @note   Function is called under interruption only, once
  *         interruptions have been enabled by HAL_LPUART_Receive_IT()
  * @param hlpuart LPUART handle.
  * @retval None
  */
static void LPUART_RxISR_16BIT_FIFOEN(LPUART_HandleTypeDef *hlpuart)
{
  uint16_t *tmp;
  uint16_t  uhMask = hlpuart->Mask;
  uint16_t  uhdata;
  uint32_t  nb_rx_data;
  uint32_t  rxdatacount;

  /* Check that a Rx process is ongoing */
  if (hlpuart->RxState == HAL_LPUART_STATE_BUSY_RX)
  {
    for (nb_rx_data = hlpuart->NbRxDataToProcess ; nb_rx_data > 0U ; nb_rx_data--)
    {
      uhdata = (uint16_t) READ_REG(hlpuart->Instance->RDR);
      tmp = (uint16_t *) hlpuart->pRxBuffPtr ;
      *tmp = (uint16_t)(uhdata & uhMask);
      hlpuart->pRxBuffPtr += 2U;
      hlpuart->RxXferCount--;

      if (hlpuart->RxXferCount == 0U)
      {
        /* Disable the LPUART Parity Error Interrupt and RXFT interrupt*/
        CLEAR_BIT(hlpuart->Instance->CR1, LPUART_CR1_PEIE);

        /* Disable the LPUART Error Interrupt: (Frame error, noise error, overrun error)
           and RX FIFO Threshold interrupt */
        CLEAR_BIT(hlpuart->Instance->CR3, (LPUART_CR3_EIE | LPUART_CR3_RXFTIE));

        /* Rx process is completed, restore hlpuart->RxState to Ready */
        hlpuart->RxState = HAL_LPUART_STATE_READY;

        /* Clear RxISR function pointer */
        hlpuart->RxISR = NULL;

#if (USE_HAL_LPUART_REGISTER_CALLBACKS == 1)
        /*Call registered Rx complete callback*/
        hlpuart->RxCpltCallback(hlpuart);
#else
        /*Call legacy weak Rx complete callback*/
        HAL_LPUART_RxCpltCallback(hlpuart);
#endif /* USE_HAL_LPUART_REGISTER_CALLBACKS */
      }
    }

    /* When remaining number of bytes to receive is less than the RX FIFO
    threshold, next incoming frames are processed as if FIFO mode was
    disabled (i.e. one interrupt per received frame).
    */
    rxdatacount = hlpuart->RxXferCount;
    if ((rxdatacount != 0U) && (rxdatacount < hlpuart->NbRxDataToProcess))
    {
      /* Disable the LPUART RXFT interrupt*/
      CLEAR_BIT(hlpuart->Instance->CR3, LPUART_CR3_RXFTIE);

      /* Update the RxISR function pointer */
      hlpuart->RxISR = LPUART_RxISR_16BIT;

      /* Enable the LPUART Data Register Not Empty interrupt */
      SET_BIT(hlpuart->Instance->CR1, LPUART_CR1_RXNEIE);
    }
  }
  else
  {
    /* Clear RXNE interrupt flag */
    __HAL_LPUART_SEND_REQ(hlpuart, LPUART_RXDATA_FLUSH_REQUEST);
  }
}

/**
  * @}
  */

#endif /* HAL_LPUART_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT PUYA *****END OF FILE****/
